W6D2/rails_olympics_production_A_skeleton 3/build_rails_project/BlogApp/app/controllers/blogs_controller.rb

    def show
        @blog = Blog.find_by(id: params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]